Ac6Embedded/svd-microchip/PIC32CK_GC/PIC32CK1012GC01064.svd
            <register>
               <name>MRCR</name>
               <description>Master Remap Control</description>
               <addressOffset>0x100</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RCB0</name>
                     <description>Remap Command Bit for Master 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>RCB0Select</name>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>Disable remapped address decoding for master</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENA</name>
                           <description>Enable remapped address decoding for master</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RCB1</name>
                     <description>Remap Command Bit for Master 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>RCB1Select</name>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>Disable remapped address decoding for master</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENA</name>
                           <description>Enable remapped address decoding for master</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RCB2</name>
                     <description>Remap Command Bit for Master 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>RCB2Select</name>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>Disable remapped address decoding for master</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENA</name>
                           <description>Enable remapped address decoding for master</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RCB3</name>
                     <description>Remap Command Bit for Master 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>RCB3Select</name>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>Disable remapped address decoding for master</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENA</name>
                           <description>Enable remapped address decoding for master</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RCB4</name>
                     <description>Remap Command Bit for Master 4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>RCB4Select</name>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>Disable remapped address decoding for master</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENA</name>
                           <description>Enable remapped address decoding for master</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RCB5</name>
                     <description>Remap Command Bit for Master 5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>RCB5Select</name>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>Disable remapped address decoding for master</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENA</name>
                           <description>Enable remapped address decoding for master</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RCB6</name>
                     <description>Remap Command Bit for Master 6</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>RCB6Select</name>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>Disable remapped address decoding for master</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENA</name>
                           <description>Enable remapped address decoding for master</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RCB7</name>
                     <description>Remap Command Bit for Master 7</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>RCB7Select</name>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>Disable remapped address decoding for master</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENA</name>
                           <description>Enable remapped address decoding for master</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RCB8</name>
                     <description>Remap Command Bit for Master 8</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>RCB8Select</name>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>Disable remapped address decoding for master</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENA</name>
                           <description>Enable remapped address decoding for master</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RCB9</name>
                     <description>Remap Command Bit for Master 9</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>RCB9Select</name>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>Disable remapped address decoding for master</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENA</name>
                           <description>Enable remapped address decoding for master</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RCB10</name>
                     <description>Remap Command Bit for Master 10</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>RCB10Select</name>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>Disable remapped address decoding for master</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENA</name>
                           <description>Enable remapped address decoding for master</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RCB11</name>
                     <description>Remap Command Bit for Master 11</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>RCB11Select</name>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>Disable remapped address decoding for master</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENA</name>
                           <description>Enable remapped address decoding for master</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RCB12</name>
                     <description>Remap Command Bit for Master 12</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>RCB12Select</name>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>Disable remapped address decoding for master</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENA</name>
                           <description>Enable remapped address decoding for master</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RCB13</name>
                     <description>Remap Command Bit for Master 13</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>RCB13Select</name>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>Disable remapped address decoding for master</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENA</name>
                           <description>Enable remapped address decoding for master</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RCB14</name>
                     <description>Remap Command Bit for Master 14</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>RCB14Select</name>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>Disable remapped address decoding for master</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENA</name>
                           <description>Enable remapped address decoding for master</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RCB15</name>
                     <description>Remap Command Bit for Master 15</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>RCB15Select</name>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>Disable remapped address decoding for master</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENA</name>
                           <description>Enable remapped address decoding for master</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <dim>13</dim>
               <dimIncrement>4</dimIncrement>
               <name>SFR[%s]</name>
               <description>Special Function</description>
               <addressOffset>0x110</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SFR</name>
                     <description>Special Function Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MEIER</name>
               <description>Master Error Interrupt Enable</description>
               <addressOffset>0x150</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>MERR0</name>
                     <description>Master 0 Access Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR1</name>
                     <description>Master 1 Access Error</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR2</name>
                     <description>Master 2 Access Error</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR3</name>
                     <description>Master 3 Access Error</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR4</name>
                     <description>Master 4 Access Error</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR5</name>
                     <description>Master 5 Access Error</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR6</name>
                     <description>Master 6 Access Error</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR7</name>
                     <description>Master 7 Access Error</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR8</name>
                     <description>Master 8 Access Error</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR9</name>
                     <description>Master 9 Access Error</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR10</name>
                     <description>Master 10 Access Error</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR11</name>
                     <description>Master 11 Access Error</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR12</name>
                     <description>Master 12 Access Error</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR13</name>
                     <description>Master 13 Access Error</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR14</name>
                     <description>Master 14 Access Error</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR15</name>
                     <description>Master 15 Access Error</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
