Ac6Embedded/svd-microchip/PIC32CK_GC/PIC32CK1012GC01064.svd
            <register>
               <name>ID_ISAR3</name>
               <description>Instruction Set Attribute Register 3</description>
               <addressOffset>0x6C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x01111110</resetValue>
               <fields>
                  <field>
                     <name>Saturate</name>
                     <description>Saturating instructions</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>SaturateSelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>No saturating instructions supported</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DSP</name>
                           <description>QADD, QDADD, QDSYB, QSUB and Q-bit supported</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SIMD</name>
                     <description>Single-instruction, multiple-data instructions</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>SIMDSelect</name>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>SSAT, USAT, and Q-bit supported</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DSP</name>
                           <description>All packed arithmetic and GE-bits supported</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SVC</name>
                     <description>Supervisor Call instructions</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>SVCSelect</name>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>SVC supported</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SynchPrim</name>
                     <description>Synchronization primitive instructions</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>SynchPrimSelect</name>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>LDREX, STREX, LDREXB, STREXB, LDREXH, STREXH, and CLREX supported</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TabBranch</name>
                     <description>Table Branch instructions</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>TabBranchSelect</name>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>TBB and TBH supported</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>T32Copy</name>
                     <description>T32 non flag-setting MOV instructions</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>T32CopySelect</name>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>Encoding T1 of MOV (register) supports copying low register to low register</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TrueNOP</name>
                     <description>True NOP instructions</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>TrueNOPSelect</name>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>NOP instruction and compatible hints supported</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>ID_ISAR4</name>
               <description>Instruction Set Attribute Register 4</description>
               <addressOffset>0x70</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x01310131</resetValue>
               <fields>
                  <field>
                     <name>Unpriv</name>
                     <description>Unprivileged instructions</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>UnprivSelect</name>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>LDRBT, LDRHT, LDRSBT, LDRSHT, LDRT, STRBT, STRHT, and STRT supported</description>
                           <value>2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WithShifts</name>
                     <description>Constant shifts instructions</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>WithShiftsSelect</name>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>Constant shifts on load/store and other instructions supported</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>Writeback</name>
                     <description>Writeback addressing modes</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>WritebackSelect</name>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>All writeback addressing modes supported</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>Barrier</name>
                     <description>Barrier instructions</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>BarrierSelect</name>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>DMB, DSB, and ISB supported</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SyncPrim_frac</name>
                     <description>Synchronization primitives fractional instructions</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>SyncPrim_fracSelect</name>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>LDREX, STREX, CLREX, LDREXB, LDREXH, STREXB, and STREXH supported</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PSR_M</name>
                     <description>M profile instructions to modify the Program Status Registers</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>PSR_MSelect</name>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>M profile forms of CPS, MRS, and MSR supported</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>ID_ISAR5</name>
               <description>Instruction Set Attribute Register 5</description>
               <addressOffset>0x74</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
            </register>
